# Задача 2.
# Написать точно такую же процедуру, но в декларативном стиле.

def quick_sort(numbers):
    return sorted(numbers, reverse=True)

print("Отсортированный список:", quick_sort)